/* 包含头文件 ----------------------------------------------------------------*/
#include "includes.h"

/* 变量定义 ------------------------------------------------------------------*/

/* 函数定义 ------------------------------------------------------------------*/
//----------------------------------------------------------------------------//
//函数功能：不可屏蔽中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void NMI_Handler(void)
{
}

//----------------------------------------------------------------------------//
//函数功能：硬Fault中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void HardFault_Handler(void)
{
	while (1)
	{
	}
}

//----------------------------------------------------------------------------//
//函数功能：Memory Management中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void MemManage_Handler(void)
{
	while (1)
	{
	}
}

//----------------------------------------------------------------------------//
//函数功能：总线Fault中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void BusFault_Handler(void)
{
	while (1)
	{
	}
}

//----------------------------------------------------------------------------//
//函数功能：用法Fault中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void UsageFault_Handler(void)
{
	while (1)
	{
	}
}

//----------------------------------------------------------------------------//
//函数功能：SV Call中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void SVC_Handler(void)
{
}

//----------------------------------------------------------------------------//
//函数功能：Debug Monitor中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void DebugMon_Handler(void)
{
}

//----------------------------------------------------------------------------//
//函数功能：Pend SV中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void PendSV_Handler(void)
{
}

//----------------------------------------------------------------------------//
//函数功能：SysTick中断函数
//入口参数：无
//出口参数：无
//最后修改：2017.2.26
//备注：
//----------------------------------------------------------------------------//
void SysTick_Handler(void)
{
	OSIntEnter();
	OSTimeTick();
#ifndef DEBUGMOD
    IWDG_ReloadCounter();	   //喂狗的时间是2.56s
#endif
	OSIntExit();
}

//----------------------------------------------------------------------------//
//函数功能：USART1中断函数
//入口参数：无
//出口参数：无
//最后修改：2017.2.3
//备注：
//----------------------------------------------------------------------------//
void USART1_IRQHandler(void)
{
	OS_CPU_SR  cpu_sr = 0;
    OS_ENTER_CRITICAL();
    OSIntEnter();
    OS_EXIT_CRITICAL();
    
    if((USART_GetITStatus(USART1, USART_IT_RXNE) == SET))
	{
		//USART_SendData(USART1, USART_ReceiveData(USART1));
		GPRSReceiveBuff[GPRSLine][GPRSRow] = (u8)USART_ReceiveData(USART1);
		GPRSRow++;
		if((GPRSRow >= 2 ) && 
            (
                (GPRSReceiveBuff[GPRSLine][GPRSRow - 2] == 0x0D && GPRSReceiveBuff[GPRSLine][GPRSRow - 1] == 0x0A)||
                (GPRSReceiveBuff[GPRSLine][GPRSRow - 2] == 0x3E && GPRSReceiveBuff[GPRSLine][GPRSRow - 1] == 0x20)/*AT “< ”号指令*/
            )
           )		//校验
		{
			OSQPost(GPRSReceiveMsgQ, GPRSReceiveBuff[GPRSLine]);		//发送消息队列
			GPRSLine++;
			GPRSRow = 0;
			if(GPRSLine == 10)
			{
				GPRSLine = 0;
			}
		}
        else if (GPRSRow >= (GPRS_RECEIVE_STRING_BUFFER_LENGTH - 1))//如果最后也没有收到最后的/r/n，那么舍弃本句话。
        {
            GPRSLine++;
			GPRSRow = 0;
			if(GPRSLine == 10)
			{
				GPRSLine = 0;
			}
        }
	}
    
    OS_ENTER_CRITICAL();
    OSIntExit();
    OS_EXIT_CRITICAL();
}

//----------------------------------------------------------------------------//
//函数功能：USART2中断函数
//入口参数：无
//出口参数：无
//最后修改：2017.10.12
//备注：
//----------------------------------------------------------------------------//
void USART2_IRQHandler(void)
{
	OS_CPU_SR  cpu_sr = 0;
    OS_ENTER_CRITICAL();
    OSIntEnter();
    OS_EXIT_CRITICAL();
    OS_ENTER_CRITICAL();
    OSIntExit();
    OS_EXIT_CRITICAL();
}

//----------------------------------------------------------------------------//
//函数功能：USART3中断函数
//入口参数：无
//出口参数：无
//最后修改：2017.10.12
//备注：
//----------------------------------------------------------------------------//
void USART3_IRQHandler(void)
{
	OS_CPU_SR  cpu_sr = 0;
    OS_ENTER_CRITICAL();
    OSIntEnter();
    OS_EXIT_CRITICAL();
    if((USART_GetITStatus(USART3, USART_IT_RXNE) == SET))
	{
        USART_ReceiveData(USART3);
//		USART_SendData(USART3, USART_ReceiveData(USART3));
	}
    
    OS_ENTER_CRITICAL();
    OSIntExit();
    OS_EXIT_CRITICAL();
}

//----------------------------------------------------------------------------//
//函数功能：TIM2中断函数
//入口参数：无
//出口参数：无
//最后修改：2017.2.3
//备注：
//----------------------------------------------------------------------------//
void TIM2_IRQHandler(void)
{
	OS_CPU_SR  cpu_sr = 0;
    OS_ENTER_CRITICAL();
    OSIntEnter();
    OS_EXIT_CRITICAL();
    
    if(TIM_GetITStatus(TIM2, TIM_IT_Update) == SET)
	{
		TIM_ClearITPendingBit(TIM2 , TIM_FLAG_Update);				//清中断标志位
	}
    
    OS_ENTER_CRITICAL();
    OSIntExit();
    OS_EXIT_CRITICAL();
}